XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM3_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Megawin</vendor>
  <name>CM3_DFP</name>
  <description>Megawin ARM Cortex-M3 MG32 M3 Series Device Support</description>
  <url>http://www.megawin.com.tw/upload/media/MCU32/megawinDFP/</url>
  <supportContact>sales@megawin.com.tw</supportContact>
  <!-- optional license file -->
  <!-- 
  <license>
  </license>
  -->
  <releases>
    <release version="1.2.0" date="2023-10-29">  
			- Update files
	</release>
    <release version="1.1.0" date="2023-02-24">  
			- Add MG32F157RCT6,MG32F157VCT6
	</release>
    <release version="1.0.0" date="2021-10-20">  
			- First create version.
	</release>	
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Megawin</keyword>
    <keyword>CM3</keyword>
    <keyword>MG32F1x</keyword>
  </keywords>
  <!-- devices section (mandatory for Device Family Packs) -->
  <!-- 
	Megawin -+
					 |
					 + MG32x Series (MG32F103C9T6/CBT6/RBT6/RCT6)
 	-->
  <devices>
    <family Dfamily="MG32 M3 Series" Dvendor="Megawin:70">
      <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
      <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
      <!-- *************************  Device 'MG32F103C9T6'  ***************************** -->
      <subFamily DsubFamily="MG32F103C9x">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 72MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F103C9T6">
          <!-- introduction -->
          <description>
The MG32F10x device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (72MHz/SWD)
- Flash Memory (96KB)
- SRAM Memory (28KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP48 / IO=37)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx3
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- USB
- LED SEGx8
          </description>
          <compile header="Device/MG32F10x/Include/system_mg32f10x.h" define="MG32F103C9T6"/>          
          <memory id="IROM1" start="0x08000000" size="0x18000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x7000" init="0" default="1"/>
          <algorithm name="Flash/MG32F103C9T6.FLM" start="0x08000000" size="0x18000" default="1"/>
        </device>
      </subFamily>
      <!-- *************************  Device 'MG32F103CBT6'  ***************************** -->
      <subFamily DsubFamily="MG32F103CBx">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 72MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F103CBT6">
          <!-- introduction -->
          <description>
The MG32F10x device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (72MHz/SWD)
- Flash Memory (128KB)
- SRAM Memory (28KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP48 / IO=37)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx3
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- I2S
- USB
- LED SEGx8
          </description>
          <compile header="Device/MG32F10x/Include/system_mg32f10x.h" define="MG32F103CBT6"/>          
          <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x7000" init="0" default="1"/>
          <algorithm name="Flash/MG32F103CBT6.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>
      </subFamily>
      <!-- *************************  Device 'MG32F103RBT6'  ***************************** -->
      <subFamily DsubFamily="MG32F103RBx">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="72000000"/>
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 72MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F103RBT6">
          <!-- introduction -->
          <description>
The MG32F10x device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (72MHz/SWD)
- Flash Memory (128KB)
- SRAM Memory (28KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP64 / IO=51)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx3
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- I2S
- USB
- LED SEGx8
          </description>
          <compile header="Device/MG32F10x/Include/system_mg32f10x.h" define="MG32F103RBT6"/>
          <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x7000" init="0" default="1"/>
          <algorithm name="Flash/MG32F103RBT6.FLM" start="0x08000000" size="0x20000" default="1"/>
        </device>
      </subFamily>
      <!-- *************************  Device 'MG32F103RCT6'  ***************************** -->
      <subFamily DsubFamily="MG32F104RCx">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000"/>
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 96MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F104RCT6">
          <!-- introduction -->
          <description>
The MG32F10x device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (96MHz/SWD)
- Flash Memory (256KB)
- SRAM Memory (36KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP64 / IO=51)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx3
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- I2S
- CAN
- USB
- SDIO
- CRC
- OPA
- AES
          </description>
          <compile header="Device/MG32F10x/Include/system_mg32f10x.h" define="MG32F104RCT6"/>          
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x9000" init="0" default="1"/>
          <algorithm name="Flash/MG32F104RCT6.FLM" start="0x08000000" size="0x40000" default="1"/>
        </device>
      </subFamily>
