XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM3_DFP.pdsc
      <!-- *************************  Device 'MG32F157RCT6'  ***************************** -->
      <subFamily DsubFamily="MG32F157RCx">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000"/>
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 96MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F157RCT6">
          <!-- introduction -->
          <description>
The MG32F157 device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (96MHz/SWD)
- Flash Memory (256KB)
- SRAM Memory (64KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP64 / IO=51)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx5
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- I2S
- CAN
- USB
- SDIO
- CRC
- OPA
- AES
          </description>
          <compile header="Device/MG32F157/Include/system_mg32f157.h" define="MG32F157RCT6"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x10000" init="0" default="1"/>
          <algorithm name="Flash/MG32F157_256.FLM" start="0x08000000" size="0x40000" default="1"/>
        </device>
      </subFamily>	  
	  
	  
      <!-- *************************  Device 'MG32F157VCT6'  ***************************** -->
      <subFamily DsubFamily="MG32F157VCx">
        <processor Dcore="Cortex-M3" DcoreVersion="r0p2" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
        <!-- <book name="Documentation/xxx.pdf" title="Cortex-M3 Generic User Guide"/> -->
        <description>
CPU Operation frequency up to 96MHz
Built-in one 24-bit system tick timer
Flash / SRAM
        </description>
        <device Dname="MG32F157VCT6">
          <!-- introduction -->
          <description>
The MG32F157 device family contains an ARM Cortex-M3 processor.

Features:
- CPU Core (96MHz/SWD)
- Flash Memory (256KB)
- SRAM Memory (64KB)
- DMA (M2M/M2P/P2M/P2P)
- GPIO (LQFP100 / IO=80)
- Timer 
- RTC
- ADC (12bit SAR ADC with 400Ksps)
- UARTx5
- I2Cx2
- SPI Mx1, SPI Sx2, QSPI
- I2S
- CAN
- USB
- SDIO
- CRC
- OPA
- AES
          </description>
          <compile header="Device/MG32F157/Include/system_mg32f157.h" define="MG32F157RCT6"/>
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1" start="0x20000000" size="0x10000" init="0" default="1"/>
          <algorithm name="Flash/MG32F157_256.FLM" start="0x08000000" size="0x40000" default="1"/>
        </device>
      </subFamily>	  	  
	  
	  
    </family>
  </devices>
  <!-- **************************************************************************************** -->
  <!-- conditions section (optional for all Software Packs)-->
  <!-- conditions selecting Devices -->
  <conditions>
    <!-- ************************************************************************** -->
    <condition id="MG32x Series">
      <description>Megawin MG32 M3 Series devices</description>
      <require Dvendor="Megawin:70" Dname="MG32F1*" />
    </condition>
    <!-- ************************************************************************** -->
    <!-- Device + CMSIS Conditions -->
    <condition id="Cortex_M3_C9T6_CMSIS">
      <description>megawin MG32F103C9T6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F103C9T6" />	  
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="Cortex_M3_CBT6_CMSIS">
      <description>megawin MG32F103CBT6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F103CBT6" />
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="Cortex_M3_RBT6_CMSIS">
      <description>megawin MG32F103RBT6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F103RBT6" />
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="Cortex_M3_RCT6_CMSIS">
      <description>megawin MG32F104RCT6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F104RCT6" />
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="Cortex_M3_157_RCT6_CMSIS">
      <description>megawin MG32F104RCT6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F157RCT6" />
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>	
    <condition id="Cortex_M3_157_VCT6_CMSIS">
      <description>megawin MG32F104RCT6 Series Device and CMSIS-Core</description>
      <require Dname="MG32F157VCT6" />
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>	
    <!-- ************************************************************************** -->
    <!-- Device + Compiler Conditions -->
    <condition id="Cortex_M3_C9T6_ARMCC">
      <description>megawin MG32F10x Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
    <condition id="Cortex_M3_CBT6_ARMCC">
      <description>megawin MG32F10x Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
    <condition id="Cortex_M3_RBT6_ARMCC">
      <description>megawin MG32F10x Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
    <condition id="Cortex_M3_RCT6_ARMCC">
      <description>megawin MG32F10x Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
	<condition id="Cortex_M3_157_RCT6_ARMCC">
      <description>megawin MG32F157 Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
    <condition id="Cortex_M3_157_VCT6_ARMCC">
      <description>megawin MG32F157 Devices and ARMCC Compiler</description>
      <require condition="MG32x Series"/>
      <require Tcompiler="ARMCC" />
    </condition>
    <!-- ************************************************************************** -->
    <!-- (All) Driver condition define -->
    <!-- Driver : MG32F103C9T6/CBT6/RBT6/RCT6 -->
    <condition id="Cortex_M3_DRIVER">
      <description>Driver files for ARMCC</description>
      <accept Dname="MG32F103C9T6"/>
      <accept Dname="MG32F103CBT6"/>
      <accept Dname="MG32F103RBT6"/>
      <accept Dname="MG32F104RCT6"/>
    </condition>
	<!-- Driver : MG32F157x -->
    <condition id="Cortex_M3_157_DRIVER">
      <description>Driver files for ARMCC</description>
	  <accept Dname="MG32F157RCT6"/>
	  <accept Dname="MG32F157VCT6"/>
    </condition>
