XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Megawin.CM3_DFP.pdsc
  </conditions>
  <!-- ********************************************************************************************************************************* -->
  <!-- component section (optional for all Software Packs)-->
  <components>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F103C9T6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_C9T6_CMSIS">
      <description>System Startup for Megawin MG32F1 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F103C9T6    /* Device Startup for MG32F103C9T6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F10x/Include/"/>
        <file category="include" name="Driver/MG32F10x/Normal_Peripheral/Include/"/>
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F10x/Include/system_mg32f10x.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_C9T6_ARMCC" name="Device/MG32F10x/Source/startup_mg32f10x.s" attr="config" version="1.0.0"/>
        <file category="sourceC" condition="Cortex_M3_C9T6_ARMCC" name="Device/MG32F10x/Source/system_mg32f10x.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F103CBT6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_CBT6_CMSIS">
      <description>System Startup for Megawin MG32F1 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F103CBT6    /* Device Startup for MG32F103CBT6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F10x/Include/" />
        <file category="include" name="Driver/MG32F10x/Normal_Peripheral/Include/" />
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F10x/Include/system_mg32f10x.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_CBT6_ARMCC" name="Device/MG32F10x/Source/startup_mg32f10x.s" attr="config" version="1.0.0" />
        <file category="sourceC" condition="Cortex_M3_CBT6_ARMCC" name="Device/MG32F10x/Source/system_mg32f10x.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F103RBT6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_RBT6_CMSIS">
      <description>System Startup for Megawin MG32F1 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F103RBT6    /* Device Startup for MG32F103RBT6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F10x/Include/" />
        <file category="include" name="Driver/MG32F10x/Normal_Peripheral/Include/" />
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F10x/Include/system_mg32f10x.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_RBT6_ARMCC" name="Device/MG32F10x/Source/startup_mg32f10x.s" attr="config" version="1.0.0" />
        <file category="sourceC" condition="Cortex_M3_RBT6_ARMCC" name="Device/MG32F10x/Source/system_mg32f10x.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F104RCT6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_RCT6_CMSIS">
      <description>System Startup for Megawin MG32F1 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F104RCT6    /* Device Startup for MG32F104RCT6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F10x/Include/" />
        <file category="include" name="Driver/MG32F10x/Normal_Peripheral/Include/" />
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F10x/Include/system_mg32f10x.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_RCT6_ARMCC" name="Device/MG32F10x/Source/startup_mg32f10x.s" attr="config" version="1.0.0" />
        <file category="sourceC" condition="Cortex_M3_RCT6_ARMCC" name="Device/MG32F10x/Source/system_mg32f10x.c" attr="config" version="1.0.0" />
      </files>
    </component>
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F157RCT6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_157_RCT6_CMSIS">
      <description>System Startup for Megawin MG32F157RCx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F157RCT6    /* Device Startup for MG32F157RCT6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F157/Include/" />
        <file category="include" name="Driver/MG32F157/Normal_Peripheral/Include/" />
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F157/Include/system_mg32f157.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_157_RCT6_ARMCC" name="Device/MG32F157/Source/startup_mg32f157.s" attr="config" version="1.0.0" />
        <file category="sourceC" condition="Cortex_M3_157_RCT6_ARMCC" name="Device/MG32F157/Source/system_mg32f157.c" attr="config" version="1.0.0" />
      </files>
    </component>	
    <!-- ******************************************************************************************* -->
    <!-- Startup for MG32F157VCT6 -->
    <!-- ******************************************************************************************* -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="Cortex_M3_157_VCT6_CMSIS">
      <description>System Startup for Megawin MG32F157VCx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_MG32F157VCT6    /* Device Startup for MG32F157VCT6 */
        #define USE_STDPERIPH_DRIVER
        #define USE_FULL_ASSERT
      </RTE_Components_h>
      <files>
        <!--  Register include folder -->
        <file category="include" name="Device/MG32F157/Include/" />
        <file category="include" name="Driver/MG32F157/Normal_Peripheral/Include/" />
        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="header" name="Device/MG32F157/Include/system_mg32f157.h" version="1.0.0" />
        <file category="sourceAsm" condition="Cortex_M3_157_VCT6_ARMCC" name="Device/MG32F157/Source/startup_mg32f157.s" attr="config" version="1.0.0" />
        <file category="sourceC" condition="Cortex_M3_157_VCT6_ARMCC" name="Device/MG32F157/Source/system_mg32f157.c" attr="config" version="1.0.0" />
      </files>
    </component>	
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- ********************************************************************************** -->
    <!-- Driver selction (MG32F10x series) -->
    <component Cclass="Driver" Cgroup="Driver-All" Cversion="1.0.0" condition="Cortex_M3_DRIVER">
      <description>Select MG32F10x driver for project</description>
      <RTE_Components_h>
      #define MG32F10x_Driver           
      </RTE_Components_h>
      <files>
        <file category="include" name="Driver/MG32F10x/Utilities_Common/Include/" version="1.0.1" />
        <file category="include" name="Driver/MG32F10x/Normal_Peripheral/Include/" version="1.0.1" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/misc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_adc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_anctl.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_bkp.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_crc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_dmac.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_exti.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_fmc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_gpio.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_i2c.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_i2s.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_iwdg.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_led.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_pwr.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_rcc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_rng.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_rtc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_sfm.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_spi.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_tim.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_uart.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/Normal_Peripheral/Source/mg32f10x_wwdg.c" version="1.0.0" />
      </files>
    </component>
    <!-- Driver selction (MG32F157x series) -->
    <component Cclass="Driver" Cgroup="Driver-All" Cversion="1.0.0" condition="Cortex_M3_157_DRIVER">
      <description>Select MG32F157x driver for project</description>
      <RTE_Components_h>
      #define MG32F157_Driver           
      </RTE_Components_h>
      <files>
        <file category="include" name="Driver/MG32F157/Utilities_Common/Include/" version="1.0.1" />
        <file category="include" name="Driver/MG32F157/Normal_Peripheral/Include/" version="1.0.1" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/misc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_adc.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_aes.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_bkp.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_can.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_crc.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_dac.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_dbgmcu.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_dmac.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_exti.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_flash.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_gpio.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_i2c.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_iwdg.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_opa.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_pwr.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_qspi.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_rcc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_rtc.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_spi.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_tim.c" version="1.0.0" />
		<file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_trng.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_usart.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F157/Normal_Peripheral/Source/mg32f157_wwdg.c" version="1.0.0" />
      </files>
    </component>	
    <!-- ********************************************************************************** -->
    <!-- USB Driver selction (MG32F1xx series) -->
    <component Cclass="Driver" Cgroup="Driver-USB" Cversion="1.0.0" condition="Cortex_M3_DRIVER">
      <description>Select MG32F1xx USB driver for project</description>
      <RTE_Components_h>
      #define MG32F10x_Driver           
      </RTE_Components_h>
      <files>
        <file category="include" name="Driver/MG32F10x/USB_Driver/Include/" version="1.0.1" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_core.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_hw.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_intr.c" version="1.0.0" />
      </files>
    </component>
    <!-- USB Driver selction (MG32F1xx series) -->
    <component Cclass="Driver" Cgroup="Driver-USB" Cversion="1.0.0" condition="Cortex_M3_157_DRIVER">
      <description>Select MG32F157 USB driver for project</description>
      <RTE_Components_h>
      #define MG32F157_Driver           
      </RTE_Components_h>
      <files>
        <file category="include" name="Driver/MG32F10x/USB_Driver/Include/" version="1.0.1" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_core.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_hw.c" version="1.0.0" />
        <file category="sourceC" name="Driver/MG32F10x/USB_Driver/Source/usbd_intr.c" version="1.0.0" />
      </files>
    </component>	
  </components>
</package>